driver-tests/bpelse/scalability/ScalabilityJbi/test/TestCase4/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <someNS:OutputMessage xmlns:someNS="http://enterprise.netbeans.org/bpel/TroubleTicketWrapper">
      <testOptions xmlns="">
        <messageId>2</messageId>
        <bpelWaitDuration>P0M0DT0H0M30S</bpelWaitDuration>
        <partnerWaitDuration>P0M0DT0H0M30S</partnerWaitDuration>
        <assignActivityCount>SMALL</assignActivityCount>
      </testOptions>
      <ns0:createTroubleTicketByValueResponse xmlns:ns0="http://java.sun.com/products/oss/xml/TroubleTicket">
        <ns0:troubleTicketKey>
          <com:applicationContext xmlns:com="http://java.sun.com/products/oss/xml/Common">
            <com:factoryClass>?string?</com:factoryClass>
            <com:url>?http://www.any.com/verrantque/temperat?</com:url>
            <com:systemProperties>
              <com:property>
                <com:name>?string?</com:name>
                <com:value>?string?</com:value>
              </com:property>
            </com:systemProperties>
          </com:applicationContext>
          <com:applicationDN xmlns:com="http://java.sun.com/products/oss/xml/Common">?string?</com:applicationDN>
          <com:type xmlns:com="http://java.sun.com/products/oss/xml/Common">?string?</com:type>
          <tro1:primaryKey xmlns:tro1="http://java.sun.com/products/oss/xml/TroubleTicket">?string?</tro1:primaryKey>
        </ns0:troubleTicketKey>
      </ns0:createTroubleTicketByValueResponse>
    </someNS:OutputMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
